{
  "name": "Eldrin Sunstrider",
  "title": "Seeker of the Arcane",
  "class": "Wizard (School of Evocation)",
  "level": 3,
  "race": "High Elf",
  "background": "Sage",
  "abilityScores": {
    "str": 8,
    "dex": 14,
    "con": 12,
    "int": 17,
    "wis": 13,
    "cha": 10
  },
  "profBonus": 2,
  "proficiencies": {
    "savingThrows": ["int", "wis"],
    "skills": ["arcana", "history", "investigation", "insight"]
  },
  "combat": {
    "ac": 12,
    "hp_max": 16,
    "speed": "30ft"
  },
  "attacks": [
    {
      "name": "Dagger",
      "atkStat": "dex",
      "dmgDie": "1d4",
      "dmgStat": "dex",
      "type": "Piercing",
      "notes": "Finesse, light, thrown (range 20/60)"
    },
    {
        "name": "Fire Bolt",
        "atkStat": "int",
        "dmgDie": "1d10",
        "dmgStat": "int",
        "dmgBonus": 0,
        "type": "Fire",
        "notes": "Ranged Spell Attack, 120ft"
    }
  ],
  "features": [
    {
      "title": "Arcane Recovery",
      "desc": "Once per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level (rounded up).",
      "uses": { "total": 1, "per": "day" },
      "key": true
    },
    {
      "title": "Sculpt Spells",
      "desc": "When you cast an evocation spell that affects other creatures that you can see, you can choose a number of them equal to 1 + the spell's level. The chosen creatures automatically succeed on their saving throws against the spell, and they take no damage.",
      "key": true
    },
    {
      "title": "Evocation Savant",
      "desc": "The gold and time you must spend to copy an evocation spell into your spellbook is halved.",
      "key": false
    },
    {
      "title": "Fey Ancestry",
      "desc": "You have advantage on saving throws against being charmed, and magic can't put you to sleep.",
      "key": false
    },
    {
      "title": "Trance",
      "desc": "Elves don’t need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day.",
      "key": false
    }
  ],
  "equipment": "A spellbook, a component pouch, a scholar's pack, a dagger, an arcane focus (crystal), a bottle of black ink, a quill, a small knife, a letter from a dead colleague posing a question you have not yet been able to answer.",
  "personality": {
    "traits": "I am horribly, horribly awkward in social situations. I use polysyllabic words that convey the impression of great erudition.",
    "ideal": "Knowledge. The path to power and self-improvement is through knowledge.",
    "bond": "I work to preserve a library, university, scriptorium, or monastery.",
    "flaw": "I am easily distracted by the promise of information."
  },
  "spellcasting": {
    "ability": "int",
    "spellSlots": {
      "level1": 4,
      "level2": 2
    }
  },
  "spells": [
    { "name": "Fire Bolt", "level": 0, "desc": "Hurl a mote of fire at a creature or object within range. Make a ranged spell attack. On a hit, the target takes 1d10 fire damage." },
    { "name": "Light", "level": 0, "desc": "Touch one object that is no larger than 10 feet in any dimension. Until the spell ends, the object sheds bright light in a 20-foot radius and dim light for an additional 20 feet." },
    { "name": "Mage Hand", "level": 0, "desc": "A spectral, floating hand appears at a point you choose within range. The hand lasts for the duration or until you dismiss it as an action." },
    { "name": "Burning Hands", "level": 1, "desc": "As you hold your hands with thumbs touching and fingers spread, a thin sheet of flames shoots forth from your outstretched fingertips. Each creature in a 15-foot cone must make a Dexterity saving throw. A creature takes 3d6 fire damage on a failed save, or half as much damage on a successful one." },
    { "name": "Detect Magic", "level": 1, "desc": "For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any." },
    { "name": "Mage Armor", "level": 1, "desc": "You touch a willing creature who isn't wearing armor, and a protective magical force surrounds it until the spell ends. The target's base AC becomes 13 + its Dexterity modifier." },
    { "name": "Magic Missile", "level": 1, "desc": "You create three glowing darts of magical force. Each dart hits a creature of your choice that you can see within range. A dart deals 1d4 + 1 force damage to its target. The darts all strike simultaneously, and you can direct them to hit one creature or several." },
    { "name": "Shield", "level": 1, "desc": "An invisible barrier of magical force appears and protects you. Until the start of your next turn, you have a +5 bonus to AC, including against the triggering attack, and you take no damage from magic missile." },
    { "name": "Thunderwave", "level": 1, "desc": "A wave of thunderous force sweeps out from you. Each creature in a 15-foot cube originating from you must make a Constitution saving throw. On a failed save, a creature takes 2d8 thunder damage and is pushed 10 feet away from you. On a successful save, the creature takes half as much damage and isn't pushed." },
    { "name": "Misty Step", "level": 2, "desc": "Briefly surrounded by silvery mist, you teleport up to 30 feet to an unoccupied space that you can see." },
    { "name": "Scorching Ray", "level": 2, "desc": "You create three rays of fire and hurl them at targets within range. You can hurl them at one target or several. Make a ranged spell attack for each ray. On a hit, the target takes 2d6 fire damage." }
  ]
}

